<?php
/*1. Перестановка местами с помощью карманов*/
	/*echo preg_replace('#([a-z]+)@([a-z]+)#i', '$2@$1','bbbasdabbbbb@a');*/

/*2. Проверка корректности указанного домена*/

	/*echo preg_match_all('#^(http(s?)://)?(www.)?[a-z0-9-]+\.(ru|com|travel)$#', 'http://site.ru', $m);*/

/*3. Замена двух идущих подряд чисел*/	

	/*echo preg_replace('#(\d)\1#','!', '1223');*/

/*4. Проверка корректности указанного времени*/	

	/*echo  preg_match('#^([0-1][0-9]|2[0-3]):[0-5][0-9]$#','23:05');*/
/*5. Проверка корректности указанного года от 1983 до 2024*/
	echo  preg_match('#(19[8][3-9]|199[0-9])|(20[0-1][0-9]|202[0-4])#','1981');
	

